:orange_circle:
```
sudo docker compose run --rm devops-utils sh -c 'cd components/test-vpc; terraform plan -no-color -var-file="../../accounts/infrastructure/network/var.tfvars"'
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-07a35b024555ea00e]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0f25a689c90f14e6c]
module.vpc.module.tier["public_subnet"].aws_subnet.this[1]: Refreshing state... [id=subnet-0d7e674ce633ceab3]
module.vpc.module.tier["public_subnet"].aws_subnet.this[2]: Refreshing state... [id=subnet-0bdf17d87760c47d6]
module.vpc.module.tier["public_subnet"].aws_subnet.this[0]: Refreshing state... [id=subnet-049ce40be4510c019]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_internet_gateway.this has been deleted
  - resource "aws_internet_gateway" "this" {
      - id       = "igw-0f25a689c90f14e6c" -> null
        tags     = {
            "Name"  = "devops-igw"
            "Owner" = "arthur"
        }
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"  = "devops-igw"
          + "Owner" = "arthur"
        }
      + tags_all = {
          + "Name"  = "devops-igw"
          + "Owner" = "arthur"
        }
      + vpc_id   = "vpc-07a35b024555ea00e"
    }

  # module.vpc.aws_route_table.public_rt will be created
  + resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"  = "devops-vpc-public-rt"
          + "Owner" = "arthur"
        }
      + tags_all         = {
          + "Name"  = "devops-vpc-public-rt"
          + "Owner" = "arthur"
        }
      + vpc_id           = "vpc-07a35b024555ea00e"
    }

  # module.vpc.aws_route_table_association.public_asso will be created
  + resource "aws_route_table_association" "public_asso" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-049ce40be4510c019"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```